{
    "data": [
        {
            "name": "Maura Murray",
            "link": "https://upload.wikimedia.org/wikipedia/en/thumb/7/79/MauraMurrayin2003.jpg/220px-MauraMurrayin2003.jpg",
            "date": "02/09/2004",
            "case": "On the surface, Maura Murray appeared to be the quintessential All-American Girl: track star, former West Point cadet, nursing student, and cute as a button. Then a series of strange events began one night while Maura was working the security desk at Melville Hall, on the campus of UMass, Amherst.",
            "article": "On the surface, Maura Murray appeared to be the quintessential All-American Girl: track star, former West Point cadet, nursing student, and cute as a button. Then a series of strange events began one night while Maura was working the security desk at Melville Hall, on the campus of UMass, Amherst. This was Thursday, February 5, 2004. A shift manager found Maura at her desk in a catatonic state. All she would say was, “my sister.” The manager escorted her back to her room. The next day, school was canceled due to snow. That Saturday, Maura’s father, Fred, came to visit, with $4,000 in cash, to find her a new car, he says, though they never purchased one. On Saturday night Maura wrecked Fred’s car on the way back to his motel room around 3:30 a.m. On Monday morning, Maura sent an email to professors, stating that she would not be in class that week due to a death in the family – this was a lie. Nobody had died.  That afternoon, Maura got into her car, stopped by an ATM to empty out her bank account, and then drove north into the White Mountains of New Hampshire, where she got into another accident, this time smashing into a snow bank. A bus driver who lived nearby stopped to ask if she needed help. She declined. The time between the accident and the moment the first officer arrived on scene was between five and seven minutes. Sometime in that window, Maura vanished.  Possible Solutions: I began investigating Maura’s disappearance in 2010 and what I found was quite shocking. Maura was not the angelic young woman presented in early media reports. At the time of her disappearance she was in trouble for credit card fraud and identity theft. She left West Point in the middle of a judicial inquiry that was launched when she stole makeup from the commissary at Fort Knox. And she had been having an affair with her track coach and sometimes told him that she wanted to run away and start a new life.  Where was Maura going when she crashed her car in New Hampshire? What happened to her afterwards? Was she heading into the White Mountains to commit suicide, to go off and die “like an old squaw,” as her father suggested to police. Was she picked up by a serial killer? Or did she use an underground railroad for abused women to aide her escape into Canada?",
            "lat": "44.1644",
            "long": "71.4326",
            "phone": "(603) 223-8813",
            "cslink": "http://www.cityofportsmouth.com/police/crimestoppers.htm",
            "id": 1
        },
        {
            "name": "Jennifer Kesse",
            "link": "https://upload.wikimedia.org/wikipedia/en/thumb/9/9d/Jennifer_Kesse.jpg/220px-Jennifer_Kesse.jpg",
            "date": "01/24/2006",
            "case": "Everything was normal for Jennifer Kesse on the morning of Jan. 24, 2006 – until it wasn't.  She woke up, showered, laid out a few outfits on her bed, got dressed, and left her Mosaic at Millenia condo for work.  Then the 24-year-old vanished.  In the decade since, the only trace police managed to find was her car, found two days later in a complex about a mile away from where she lived.",
            "article": "Jennifer Kesse left her Conroy Road apartment in January 2006 and hasn't been heard from since. Investigators released new information in hopes of finding her.  Kesse's family continues to show strength in the face of anguish. She was only 24 years old when she did not show up for work in January 2006. Kesse's parents believe somebody knows what happened that morning and all they want is information that will lead them to her.  Many searches have been conducted over the years with no results. Authorities searched an area of South Florida last month, based on a tip.  Police said tips are still coming in 10 years later and they work on the case weekly, if not daily.  Items found in Kesse's car are being retested with the latest technology. Authorities are trying to identify the person who was seen walking from the area where her car was last seen.  Kesse's mother wonders if parents at the Huntington Green complex where the car was found would talk with children who might have been too young to come forward then",
            "lat": "28.4877813",
            "long": "-81.4230734",
            "phone": "(407) 246-2470",
            "cslink": "https://crimeline.org/",
            "id": 2
        },
        {
            "name": "The Girl Scout Murders",
            "link": "http://cdn.onlyinyourstate.com/wp-content/uploads/2016/01/ok317-6.jpg",
            "date": "06/13/1977",
            "case": "The person or people involved in the heinous act carried the girls’ bodies away from their tent, which were then found by a counsellor on the trail on the way to the showers. Before the murders, someone broke into a counsellor tent and left a note saying that three campgoers would be murdered, but it was believed to be a prank. Two months after the “prank” letter was sent, the three girls turned up dead. No one has been charged with the murders.",
            "article": "The Oklahoma Girl Scout murders is an unsolved murder case that occurred on the morning of June 13, 1977, at Camp Scott in Mayes County, Oklahoma. The victims were three girl scouts, between the ages of 8 and 10, who were raped and murdered. Their bodies had been left on a trail leading to the showers, about 150 yards from their tent at summer camp.Less than two months before the murders, during an on-site training session, a camp counselor discovered that her belongings had been ransacked and her doughnuts had been stolen. Inside the empty doughnut box was a disturbing hand-written note. The writer of the note vowed to murder three campers. The director of that camp session treated the note as a prank, and it was discarded. Monday, June 13, 1977, was the first day of camp. At around 7 p.m. the night before, a thunderstorm hit the area, and the girls huddled in their tents. Among them were Lori Lee Farmer, 8, Doris Denise Milner, 10, and Michelle Heather Guse, 9. The girls were residents of Broken Arrow, Okla",
            "lat": "36.2001",
            "long": "95.1677",
            "phone": "(918) 479-8121",
            "cslink": "https://okccrimetips.com/",
            "id": 3
        },
        {
            "name": "Brian Shaffer",
            "link": "http://i2.wp.com/media.boingboing.net/wp-content/uploads/2016/05/brs.jpg?resize=300%2C225",
            "date": "03/31/2006",
            "case": "Brian Shaffer was dashingly handsome med student at Ohio State University when he disappeared after a night of drinking, on Friday, March 31, 2006. Shaffer and his friend, William “Clint” Florence, met up at the Ugly Tuna Saloona around 9 p.m. and then went bar-hopping for several hours before returning to the Ugly Tuna just before 2 a.m. The bar’s security camera shows Brian walking in but never coming out, again.",
            "article": "Brian Shaffer was dashingly handsome med student at Ohio State University when he disappeared after a night of drinking, on Friday, March 31, 2006. Shaffer and his friend, William “Clint” Florence, met up at the Ugly Tuna Saloona around 9 p.m. and then went bar-hopping for several hours before returning to the Ugly Tuna just before 2 a.m. The bar’s security camera shows Brian walking in but never coming out, again. His friends say they figured he’d gone home. He wasn’t reported missing until Monday, when he didn’t show up to catch a flight to Miami, where he planned to spend Spring Break with his girlfriend.  Possible Solutions: Not long before he went missing, Brian Shaffer’s mother died and those close to him say he took it hard. This event, and the pressures of medical school, lead some to believe he committed suicide, though no body has ever been found. Perhaps instead of killing himself, he simply walked away from his life. Others suspect foul play. His friend, Clint Florence, refuses to take a lie detec",
            "lat": "39.9938",
            "long": "83.0065",
            "phone": "(614) 645-4624",
            "cslink": "http://stopcrime.org/",
            "id": 4
        },
        {
            "name": "Elisa Lam",
            "link": "https://img.buzzfeed.com/buzzfeed-static/static/2015-10/29/12/enhanced/webdr05/grid-cell-30850-1446134859-5.jpg",
            "date": "01/31/2013",
            "case": "Twenty-one-year-old Canadian student Elisa Lam went missing at the end of January and was found dead two weeks later in her hotel’s water tank.  Why is it so creepy? Following her disappearance, security footage showing Elisa behaving erratically was released by the Los Angeles Police Department, but speculations of Elisa being on drugs were disputed by the toxicology report.",
            "article": "Twenty-one-year-old Canadian student Elisa Lam went missing at the end of January and was found dead two weeks later in her hotel’s water tank.  Why is it so creepy? Following her disappearance, security footage showing Elisa behaving erratically was released by the Los Angeles Police Department, but speculations of Elisa being on drugs were disputed by the toxicology report. Hotel Cecil had a dark past before the death of Elisa Lam. Elisa was found after guests complained of black water, which prompted staff to check the water tanks. This follows closely the plot of the film Dark Water (2005), where a girl was found dead in the hotel’s water tank in a similar way. In the film, the main character’s daughter’s name is Cecilia, which is very close to the name of the hotel where Elisa Lam died. In a strange coincidence, the tuberculosis test that was used in the area near the hotel at the time of Elisa Lam’s death was called LAM-ELISA.",
            "lat": "34.0522",
            "long": "118.2437",
            "phone": "1-877-275-5273",
            "cslink": "http://www.lapdonline.org/report_a_crime",
            "id": 5
        }
    ]
}