{
    "data": [
        {
            "name": "Hang Lee",
            "photo": "http://www.charleyproject.org/images/l/lee_hang.jpg",
            "date": "10/09/1975",
            "case": "There’s no proof of what happened to her. At 17, she walked out of her family home, never to be seen, again. Her brother remembers the final haunting words she said to him: “Koua, if I don’t come back, come and look for me.” Allegedly, she was last seen with a convicted sex offender, but no one has been arrested in her case. Police are still looking for answers.",
            "article": "DAILY REMINDER  In the missing-persons unit at the St. Paul Police Department, investigators have a daily reminder of Hang — her photo is taped on the wall.  “We look at it, and it’s like an incentive for us to figure this out,” said officer Benny Williams. “We look at it every day.”  Police have revisited the case at various times and a trio of St. Paul police missing-persons investigators, including Williams, have been spending time on it in more recent years between their daily cases and other older cases.  Twenty-one years ago today, Mark Steven Wallace allegedly met with Hang Lee about hiring her to work for him. Wallace, then 30, was supposed to take Hang Lee home, police say. She never arrived.  Wallace, now 51, could not be reached for comment for this story.  Hang Lee remains classified as a missing person because there’s no proof of what happened to her, said Sgt. Paul Paulos, a police spokesman.  Police always hope that media attention on the case might bring forth information.  “After this amount of time, we hope that people might feel compassion to come forward and tell what happened,” Paulos said. “Any little tidbit of information could help.”  When Hang Lee disappeared, Wallace had been out of prison for about a year and a half after being convicted in two criminal sexual conduct cases.  In one, Wallace was convicted of raping a 16-year-old girl in Cottage Grove who’d gone with him on the promise of a job interview. He held a knife to her, tied her up and put duct tape over her eyes and mouth, according to the criminal complaint. Wallace told the teen he would kill her and her family if she said anything about what happened, the complaint said.  ‘BAD FEELING THAT … CRAWLED UP MY NECK’  In 1993, Hang Lee was a senior at Highland Park High School. She wanted to go to the University of Minnesota, her brother said.  Hang had started working as a cashier at Wong Cafe on Rice Street when she was 13, Koua Lee said. Hang had helped him get a dishwashing job at the restaurant.  On Jan. 12, 1993, a Tuesday, the phone rang at the Lee home and Koua answered it. It was Kia “Nikki” Lee, an 18-year-old friend of Hang’s, Koua said. She and Hang talked, and Hang told her brother she was going out with Nikki and was going to have a job interview with Nikki’s boss, Koua said.  Hang was looking for an additional job because she wasn’t making much money, Koua said. She left home at 6 or 7 p.m., he said.  Koua went to sleep about 10 p.m. and woke at about 1 a.m. Hang usually knocked on the front door when she got home and her brother would let her in, he said. That night, Koua Lee hadn’t heard a knock, and he looked out the window of the apartment they lived in then at McDonough Homes, public housing in St. Paul.  “The snow was coming down pretty hard, and I didn’t see footprints from the parking lot,” Koua said. “I got up just to see if I missed her or if she was going to be on her way. I did have a bad feeling that kind of crawled up my neck, but of course I was still a kid and I didn’t know what to do.”  Hang put her friends and family before herself, Koua said.  “She’s very loyal,” he said. “She doesn’t betray her friends. She trusted people very fast,” which also may have put her at risk, her brother said.  The next day at Como High School, which Koua Lee and Nikki Lee attended, Koua said he asked Nikki, “Do you know where my sister is?” She said she didn’t, according to Koua.  Hang Lee’s mother reported her daughter missing to police a few days later. Koua doesn’t think police initially took the case as seriously as they do now, probably suspecting the teen had run away. And because his mother and father didn’t speak English (they spoke Hmong), Koua said, they didn’t know the proper channels to push for Hang’s case to get attention.  Williams, the investigator, said he believes officers back then “did everything they were supposed to do and then some, but I think they may have been under the impression that she was a runaway and she was going to come back.”  SNOWFALL, SWITCHED CARS  Police soon were looking into Wallace. A news article published in 1994, after Hang had been missing for a year, said that police had questioned Wallace but found him uncooperative and that he’d retained a lawyer who advised him to say nothing further.  The St. Paul police investigators now working on the case have not talked to Wallace, but they have talked to Nikki Lee.  Nikki Lee worked for Wallace, who had a small painting company, according to Williams. Wallace asked Nikki if she had friends who might be interested in working for him and the first person who came to mind for her was Hang Lee, Nikki Lee reported, according to Williams.  “She said the funny thing about it was he didn’t have enough work for her to do, so why would he be asking her to find someone else?” Williams said of what Nikki Lee recounted. The Pioneer Press could not reach Nikki Lee for this story.  Wallace picked the girls up in a white pickup truck, possibly a four-wheel drive. “He had mentioned taking them to the casino,” Williams said. “It was really snowing and Nikki said, ‘Well, we have school tomorrow.’ ”  Jan. 12, 1993, saw the first significant snowfall of that season, according to news reports from the time. Six inches of snow fell, Minnesota Climatology Working Group records show.  On the way back, while Wallace was still with Nikki Lee and Hang Lee, he switched cars for reasons police don’t know. It was a 1988 tan or silver Chevrolet Cavalier, said officer Mong Lee, another investigator on the case.  Nikki Lee told police that Wallace said he’d drop her off at her home in Frogtown first and then Hang Lee because she lived closer to him (Wallace lived in Maplewood then), Williams said. Nikki Lee reported that she got out of Wallace’s car and looked back. She saw Hang, who’d been sitting in the back, getting into the front passenger seat, Williams said. That was the last time she saw her friend and she had no idea what happened to her, she told police.  Sgt. Kevin Navara, who has spent years at the Ramsey County Sheriff’s Office investigating Hang Lee’s disappearance, was also there for the conversation with Nikki Lee; he said he believes her.  Wallace previously told police he dropped Hang off at Rice Street and Wheelock Parkway, near the restaurant where she worked, Williams said.  WALLACE’S CRIMINAL RECORD  The two rapes that Wallace was convicted of occurred March 31, 1987, in Cottage Grove and April 9, 1987, in St. Paul. In the second case, a 23-year-old woman said she was waiting for a bus when a man at the bus stop told her he could get them a ride, according to a police report.  They walked away and, she told police, the man threw her to the ground, put her sock into her mouth, and taped her mouth and eyes shut, the report said. The man tied her up and raped her, the woman told police. He used a knife to “jab” her in the back, the report also said.  Then, on May 19, 1987, a 22-year-old woman told police that an unknown man had called her and offered her a job in the radio industry, a police report said. She’d set up a meeting with him but was suspicious because she knew personal records of hers had been taken in a theft from a teacher’s vehicle.  An undercover female officer went to the meeting in the woman’s place. The man who met her, later identified as Wallace, got into her car and had her drive around, supposedly to an office, the report said.  Police arrested Wallace. He was carrying a bag that contained a knife and a roll of black tape, the report said.  Wallace told police that he had broken into a car, taken records and made phone calls to a woman whose information he found in the records, a police report said. His intention was to rape her, the report also said.  Convicted of criminal sexual conduct in the St. Paul and Cottage Grove cases, Wallace was sent to prison in August 1988 and got out on supervised release in June 1991. His sentence expired Jan. 10, 1993, according to state records.  Wallace was sent back to prison in 2010 after being convicted of theft by swindle and identity theft. He is on supervised probation for convictions in October for gross-misdemeanor theft and felony drug possession in Wright County.  WHERE IS HANG?  Police occasionally check Hang Lee’s Social Security number to see if she’s working or getting benefits, but there has been no activity.  Koua Lee said he hopes his sister is alive, but he thinks the chance is slim because she would have contacted him if she could.  In 2009, a promising lead in the case fizzled out. The Maplewood home where Wallace grew up and where he’d continued to live on and off was in foreclosure and Wallace had to move out, according to a search warrant affidavit.  Navara, the sergeant for the sheriff’s office, got permission to conduct a cadaver-dog search of the property. Three dogs showed interest in an area on the back wall of the garage.  After a ground probe was used to allow any odors to rise up through the ground, each dog — one at a time — gave alerts that indicate “a presence of either human bone, human blood, or human flesh in the area,” Navara wrote in the affidavit. The garage had been completed in 2004, about 10 years after Hang Lee disappeared, the affidavit said.  The warrant, which was granted, was to drill holes in the garage’s concrete floor to probe the soil underneath for the cadaver dogs to pinpoint the exact location of the evidence, the affidavit said. When the dogs came back for a second search, most failed to indicate an alert for human remains, Navara has said.  In 2011, the National Center for Missing and Exploited Children released an age-progressed photo of Hang Lee, something the organization does every two years until a missing child turns 21 and every five years after that, until he or she is found, said Bob Lowery, senior executive director of the missing children division.  “They’re good for public dissemination in case someone sees a person who looks like the child,” he said. “It also serves to remind the public that we don’t forget about cases like Hang’s just because she’s been gone since 1993. We still remember, we’re still actively searching for her.”  ‘SOMEONE KNOWS SOMETHING’  St. Paul police don’t close any missing-person case unless it’s been solved.  Police ask anyone with information about Hang Lee to come forward, officer Mong Lee said. Police said they’ll take any piece of information people have, including anyone who remembers seeing anything suspicious on Jan. 12, 1993, or in the days after. People can make their tips anonymously, Mong Lee said.  “Anytime there’s a disappearance or a crime, usually someone knows something,” officer Williams said. “They may be a little hesitant to come forward or they may say, ‘I don’t want to get involved,’ but someone knows something.”  Hang Lee’s family also wishes for help to solve her disappearance.  “I just hope people find it in their heart to call the St. Paul Police Department if they know anything to help find her,” Koua Lee said. “More than anything, I want to find closure for my mom.”",
            "phone": "651-266-5612",
            "link": "http://www.crimestoppersmn.org/",
            "crime_id": 1
        },
        {
            "name": "Jennifer Kesse",
            "photo": "https://upload.wikimedia.org/wikipedia/en/thumb/9/9d/Jennifer_Kesse.jpg/220px-Jennifer_Kesse.jpg",
            "date": "01/24/2006",
            "case": "Everything was normal for Jennifer Kesse on the morning of Jan. 24, 2006 – until it wasn't.  She woke up, showered, laid out a few outfits on her bed, got dressed, and left her Mosaic at Millenia condo for work.  Then the 24-year-old vanished.  In the decade since, the only trace police managed to find was her car, found two days later in a complex about a mile away from where she lived.",
            "article": "Video surveillance showed a person parking the car, then leaving without looking back. In the decade since, police have not found any leads significant enough to find Kesse.  Her parents, Drew and Joyce Kesse, joined Orlando police detectives at a press conference on Friday. They pleaded for anyone with information to come forward.   Pictures: Jennifer Kesse Pictures about Jennifer Kesse. (Orlando Sentinel) \"Jennifer needs the public more than any time before because we know more than one person knows what happened to Jennifer 10 years ago,\" Drew Kesse said. \"The answers are always there, they've always been there. We just haven't been able to see them clearly yet.\"  Detectives are still actively working leads.  The latest tip led them to search the Sands Key area of Biscayne National Park near the coast of Miami just last month. Orlando police worked with the National Park Service to lead a land, air and sea search of the island, according to Orlando police Det. Teresa Sprague.  But the search was fruitless, she said.  Sprague also said detectives are resubmitting evidence from the car to the Florida Department of Law Enforcement for testing.  \"We are hoping that new testing methods and technology will give us new leads,\" said Sprague.  Other efforts in years past have included convening a 17-member panel of law-enforcement experts, an investigation by the FBI and releasing last year an age-progressed photo of what she might look like now.  Sprague said police have received more than 1,000 tips and they continue to come in almost weekly.  She said it's time for the Kesse family to receive answers.  \"Imagine waking up and your daughter is no where to be found,\" Sprague said. \"You can't reach her, you can't locate her. The police can't locate her. Hours turn into panic and days into your worst nightmare. I cannot imagine the nightmare the Kesse family has been sleepwalking through for the last 10 years.\"  Kesse was last heard from via a telephone call with her boyfriend from her residence in the 3700 block of Conroy Road at about 10 p.m. on Jan. 23, 2006.  Police believe she left for work around 8 a.m. the next day when she was abducted.  For more than three months after her disappearance, the Kesse family stood at the intersection of John Young Parkway and Conroy Road at rush hour, waving their signs to the long line of drivers.  The case received national attention, including features on \"48 Hours\" and \"On the Record with Greta Van Susteren\" on the Fox News Channel.  On Friday, Drew Kesse talked directly to the person who abducted his daughter.  \"Your usefulness for what you took her for, it has to be done. It has to be over,\" he said. \"And if you've done something with her that she's no longer with us, please give us the opportunity to bring Jennifer home.\"  He said he came to the realization about two years ago that his daughter is likely dead. It's more important that they find her, he said.  \"It doesn't matter, at least to this father, the condition Jennifer is in anymore,\" he said. \"I hate to say that [but] it's time for Jennifer to come home.\"  The family set up website, jenniferkesse.com, and social media pages. The reward for information is $15,000.  \"We're still waiting for that one person to come through with that one bit of information that can bring Jennifer home for the good or the bad,\" Drew Kesse said.  Even after a decade has gone by, the Kesse's have not given up hope.  And they will never stop looking.  \"We're not going to go anywhere,\" Joyce Kesse said.",
            "phone": "407.246.2425",
            "link": "https://crimeline.org/",
            "crime_id": 2
        },
        {
            "name": "Jamie Santos",
            "photo": "http://vignette1.wikia.nocookie.net/unsolvedmysteries/images/7/7e/Jamie_santos1.jpg/revision/latest?cb=20110911020016",
            "date": "10-28-1991",
            "case": "The emergency line in Wheeling, Illinois, received a strange call on October 28, 1991. An unknown man called the emergency number, giving the address of an unconscious woman. Before the operator could get more information, he hung up the phone. Paramedics arrived on the scene to find exotic dancer Jamie Santos nearly dead in her home. Jamie appeared to have struggled with her killer and ultimately died from asphyxiation by pillow. (The previous day, Jamie cancelled various appointments, leading police to wonder whether she had expected something odd to happen.) Police believe a former customer may have killed Jamie, but with almost no evidence, the case never progressed.",
            "article": "http://unsolvedmysteries.wikia.com/wiki/Jamie_Santos",
            "phone": "(847) 459-2632",
            "link": "42.1392",
            "crime_id": 3
        }
    ]
}